## Plan Result (account-delete-monitor-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11807465368)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * aws_sns_topic_subscription.UserEvents-sns-subscription
* Update
  * aws_sqs_queue_policy.adm-sns-dlq-policy
  * aws_sqs_queue_policy.adm-sns-sqs-policy
* Delete
  * aws_sns_topic_subscription.UserEventTopic-sns-subscription



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_sns_topic_subscription.UserEventTopic-sns-subscription will be destroyed
  # (because aws_sns_topic_subscription.UserEventTopic-sns-subscription is not in configuration)
  - resource "aws_sns_topic_subscription" "UserEventTopic-sns-subscription" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:90a94ef0-2351-48d4-9b4d-7259e72aee5a" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:sqs:us-east-1:996905175585:AccountDeleteMonitor-Prod-EventTracker-Queue" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:90a94ef0-2351-48d4-9b4d-7259e72aee5a" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "sqs" -> null
      - raw_message_delivery            = false -> null
      - redrive_policy                  = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:AccountDeleteMonitor-Prod-SNS-Topics-DLQ"
            }
        ) -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.UserEvents-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "UserEvents-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:AccountDeleteMonitor-Prod-EventTracker-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:AccountDeleteMonitor-Prod-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents"
    }

  # aws_sqs_queue_policy.adm-sns-dlq-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "adm-sns-dlq-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDeleteMonitor-Prod-SNS-Topics-DLQ"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:SourceArn" = [
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents",
                                    "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserMerge-Topic",
                                ]
                            }
                        }
                      - Sid       = ""
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.adm-sns-sqs-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "adm-sns-sqs-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDeleteMonitor-Prod-EventTracker-Queue"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:SourceArn" = [
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents",
                                    "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserMerge-Topic",
                                ]
                            }
                        }
                      - Sid       = ""
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":950,"Program":"tfcmt","SHA1":"30995768cfe3eb840fc69e2735e0ffbba670a40e","Target":"account-delete-monitor-cdk-production","Vars":{},"WorkflowName":"Account Delete Monitor"} -->